{
"manager": [
  "You manage expectations… mostly by lowering them.",
  "Your leadership style is just forwarding emails with 'FYI'.",
  "You delegate like you're dodging responsibility.",
  "You think 'synergy' is a spell from Harry Potter.",
  "You inspire confusion, not confidence.",
  "You schedule meetings like you're playing Minesweeper.",
  "You lead like a motivational poster — outdated and ignored.",
  "You think 'ASAP' means 'whenever I feel like it'.",
  "You manage like a browser with 50 tabs open — all frozen.",
  "You call it multitasking, we call it chaos.",
  "You think 'team bonding' means forced karaoke.",
  "You lead like a GPS with no signal.",
  "You think 'strategy' means 'slide deck'.",
  "You manage like Excel — full of errors and crashes.",
  "You think 'open door policy' means 'leave me alone'.",
  "You delegate like you're playing hot potato.",
  "You think 'vision board' is a Pinterest account.",
  "You lead like a group project — absent until the end.",
  "You think 'KPIs' are just alphabet soup.",
  "You manage like a traffic jam — loud and slow.",
  "You think 'leadership' means louder emails.",
  "You motivate like a Monday morning.",
  "You think 'follow-up' means ghosting politely.",
  "You lead like a broken compass — confidently lost.",
  "You think 'clean inbox' is a personality trait.",
  "You manage like a pop-up ad — annoying and unavoidable.",
  "You think 'workflow' means walking in circles.",
  "You lead meetings like bedtime stories — everyone falls asleep.",
  "You think 'agile' means changing your mind every hour.",
  "You manage like a group chat admin — mute and missing.",
  "You think 'deadline' is a suggestion, not a date.",
  "You lead like a weather app — mostly wrong.",
  "You think 'feedback' is a compliment.",
  "You manage like a vending machine — unresponsive and full of junk.",
  "You think 'teamwork' means others work.",
  "You lead like a motivational quote — pretty but useless.",
  "You think 'calendar invite' is a threat.",
  "You manage like a spreadsheet with no formulas.",
  "You think 'alignment' means everyone agrees with you.",
  "You lead like a sitcom boss — clueless but confident."
],
  "developer": [
  "You write bugs faster than Git can track.",
  "Your code is so spaghetti, even Italians are offended.",
  "You debug by crying and hoping the problem fixes itself.",
  "You think semicolons are optional feelings.",
  "Your logic is so twisted, even recursion gets confused.",
  "You use Stack Overflow like it’s your personal diary.",
  "You commit chaos and call it a feature.",
  "You test in production and pray.",
  "You think ‘clean code’ means deleting everything.",
  "You name variables like you’re writing a mystery novel.",
  "You think ‘console.log’ is a debugging strategy.",
  "You code like you’re paid per bug.",
  "You think ‘merge conflict’ is a personality trait.",
  "You write comments like you’re leaving breadcrumbs for future archaeologists.",
  "You think ‘async’ means ‘never’.",
  "You code like you’re solving a riddle — badly.",
  "You think ‘deployment’ means chaos.",
  "You write code that even AI refuses to read.",
  "You think ‘version control’ means panic.",
  "You code like you’re blindfolded.",
  "You think ‘documentation’ is a bedtime story.",
  "You write functions that function like fiction.",
  "You think ‘DRY’ means desert coding.",
  "You code like you’re playing Minesweeper.",
  "You think ‘runtime error’ is a compliment.",
  "You write loops that loop into oblivion.",
  "You think ‘syntax’ is a tax.",
  "You code like you’re solving a mystery — with no clues.",
  "You think ‘API’ means ‘Ask People Instead’.",
  "You write code that needs therapy.",
  "You think ‘framework’ means ‘confusion kit’.",
  "You code like you’re building a haunted house.",
  "You think ‘refactor’ means rename everything randomly.",
  "You write code that even your future self will hate.",
  "You think ‘full stack’ means full stress.",
  "You code like you’re trying to win hide-and-seek.",
  "You think ‘agile’ means running from bugs.",
  "You write code that screams for help.",
  "You think ‘hotfix’ means ‘hope and pray’.",
  "You code like you’re allergic to indentation.",
  "You think ‘unit test’ is a medical procedure."
],
"designer": [
  "You spent 3 hours choosing a font… and still picked Comic Sans.",
  "You call it 'minimalist' because you forgot half the elements.",
  "Your color palette looks like a unicorn threw up.",
  "You design like you're paid in pixels, not performance.",
  "You think whitespace is just empty space to ignore.",
  "You use gradients like you're painting a sunset on a clown.",
  "You call it 'abstract' because it makes no sense.",
  "You design like you're allergic to alignment.",
  "You think contrast means neon on neon.",
  "You spent 4 hours kerning one word… and still missed the deadline.",
  "You design like you're trying to confuse the user.",
  "You think 'UX' means 'U eXperiment'.",
  "You use drop shadows like you're hiding something.",
  "You think 'responsive design' means resizing the browser and crying.",
  "You design like you're building a maze, not a website.",
  "You think 'accessibility' means adding alt text that says 'image'.",
  "You use animations like you're directing a Bollywood musical.",
  "You design like you're throwing glitter at a wireframe.",
  "You think 'user flow' means a river of confusion.",
  "You design like you're trying to win a hide-and-seek contest.",
  "You think 'grid system' is a conspiracy theory.",
  "You use icons that look like ancient hieroglyphs.",
  "You design like you're solving a puzzle with missing pieces.",
  "You think 'modern design' means removing everything useful.",
  "You use fonts like you're mixing cocktails — blindly.",
  "You design like you're trying to impress aliens.",
  "You think 'dark mode' means black text on black background.",
  "You design like you're in a race to confuse the client.",
  "You use color theory like it's a myth.",
  "You think 'prototype' means 'almost broken'.",
  "You design like you're building a haunted house.",
  "You use stock photos like you're decorating a dentist's office.",
  "You think 'branding' means slapping a logo everywhere.",
  "You design like you're trying to win a sticker contest.",
  "You use typography like you're playing Jenga.",
  "You think 'visual hierarchy' means chaos with layers.",
  "You design like you're allergic to consistency.",
  "You use feedback as a suggestion to do the opposite.",
  "You think 'simplicity' means removing all logic.",
  "You design like you're building a puzzle with no solution."
],
"analyst": [
  "You analyze everything except your own browser history.",
  "You found a correlation between coffee and confusion.",
  "Your dashboards are just colorful chaos.",
  "You pivot tables like you're dodging accountability.",
  "You say 'correlation' like it's a personality trait.",
  "You think 'data-driven' means driven to madness.",
  "You analyze trends like you're reading tea leaves.",
  "You think 'insights' are just fancy guesses.",
  "You use Excel like it's a video game.",
  "You think 'variance' is a mood swing.",
  "You forecast like you're playing darts blindfolded.",
  "You call it predictive modeling — we call it wishful thinking.",
  "You think 'outliers' are just people you don't like.",
  "You analyze like you're solving a mystery with no clues.",
  "You think 'data cleaning' means deleting everything suspicious.",  
  "You use pie charts like you're baking confusion.",
  "You think 'standard deviation' is a personality flaw.",
  "You analyze like you're trying to impress your cat.",
  "You think 'data lake' is a vacation spot.",
  "You use filters like you're hiding from responsibility.",
  "You think 'confidence interval' is how long you can fake it.",
  "You analyze like you're writing a novel — dramatic and confusing.",
  "You think 'big data' means big problems.",
  "You use VLOOKUP like it's a magic spell.",
  "You think 'trendline' is a fashion statement.",
  "You analyze like you're building a conspiracy theory.",
  "You think 'data wrangling' involves a lasso.",
  "You use scatter plots like you're throwing darts at a wall.",
  "You think 'regression' is a personal issue.",
  "You analyze like you're trying to win a guessing game.",
  "You think 'data warehouse' is where you store disappointment.",
  "You use bar charts like you're building fences.",
  "You think 'normal distribution' is a social experiment.",
  "You analyze like you're narrating a soap opera.",
  "You think 'metrics' are just numbers with attitude.",
  "You use dashboards like you're decorating a spaceship.",
  "You think 'data integrity' means not cheating on your spreadsheets.",
  "You analyze like you're solving a riddle written in emojis.",
  "You think 'KPIs' are just alphabet soup.",
  "You use averages like you're smoothing over failure."
],
  "intern": [
  "You bring enthusiasm and a startling lack of experience.",
  "You staple without knowing which side is up.",
  "Your LinkedIn says 'eager to learn' and HR says 'send them coffee'.",
  "You answer questions with more questions and less help.",
  "You think 'going viral' means catching a cold in the break room.",
  "You make Post-it notes look like a strategic plan.",
  "You take credit for things you watched someone else do.",
  "You treat the copy machine like a mysterious relic.",
  "You schedule meetings with enthusiasm, not purpose.",
  "You ask for feedback and treat it like a surprise party.",
  "You manage to break things by looking at them.",
  "You treat deadlines like optional suggestions.",
  "You refer to your internship as a 'trial membership'.",
  "You think 'prior experience' means having watched tutorials.",
  "You bring snacks and call it team building.",
  "You RSVP to meetings but rarely attend the agenda.",
  "You send emails that begin with 'per my...' and end with confusion.",
  "You wear confidence like it's a costume on casual Friday.",
  "You learn software by exploring every menu until it gives up.",
  "You intern so hard you turn coffee into spreadsheets.",
  "You think office politics is a board game.",
  "You treat every task as a quest for a badge.",
  "You file things by mood instead of method.",
  "You bookmark tabs like trophies of indecision.",
  "You staple reports like you're defusing a bomb.",
  "You call asking for help 'networking'.",
  "You show initiative by rearranging the sugar packets.",
  "You think 'ASAP' means 'after snacks and pretzels'.",
  "You push priorities like they're tennis balls — away.",
  "You learn company jargon and use it with reckless abandon.",
  "You perfect the art of busy-looking without results.",
  "You take 'shadowing' to mean following them to the vending machine.",
  "You turn every simple task into a research paper.",
  "You leave trails of half-finished snacks and ambition.",
  "You file 'urgent' under 'maybe later'."
],
  "hr": [
    "You put the 'human' in human resources… and the 'robot' in human relations.",
    "You call it 'confidential' and then forward it to the whole office.",
    "Your idea of empathy is a mandatory training module.",
    "You schedule 'check-ins' that feel like performance ambushes.",
    "You treat onboarding like a scavenger hunt with legal forms.",
    "You manage benefits like you're hoarding secret treasure maps.",
    "You think 'culture fit' means matching the mug collection.",
    "You resolve conflicts by emailing a policy and disappearing.",
    "You say 'we value feedback' and then retire to a meeting room.",
    "You handle layoffs with the warmth of an auto-reply.",
    "You file complaints like you're organizing a tax audit.",
    "You call HR the people people, but avoid people at all costs.",
    "You send motivational quotes between compliance memos.",
    "You think 'open door' policy means 'open calendar slot at 4pm'.",
    "You protect the company like a firewall — strict and invisible.",
    "You attend every drama but never bring snacks.",
    "You use buzzwords like 'synergy' to sound like a therapist.",
    "You think transparency is a PDF with tiny font.",
    "You answer employee concerns with a link and good luck.",
    "You treat employee morale like a quarterly KPI.",
    "You celebrate diversity by renaming the training module.",
    "You handle disputes like a judge who forgot the gavel.",
    "You believe every problem can be solved with a form.",
    "You manage payroll like it's a mysterious ritual.",
    "You respond to emotional emails with emoji and HR-speak.",
    "You think coaching means forwarding an article titled 'Be Better'.",
    "You schedule 'team-building' where everyone silently judges each other.",
    "You protect company secrets better than you protect meeting agendas.",
    "You enforce policies with the enthusiasm of a broken printer.",
    "You call it 'professional development' and hand out a spreadsheet.",
    "You run background checks like you're auditioning for a spy movie.",
    "You view office politics as a strategic board game.",
    "You measure happiness with a checkbox that says 'neutral'.",
    "You fix morale by renaming job titles and calling it innovation.",
    "You keep an employee file like it's a mystery novel — missing pages included.",
    "You send wellness tips at 3 AM and expect gratitude.",
    "You treat PTO like a treasure map and holiday requests like quests.",
    "You practice conflict resolution by forwarding 'best practices' PDFs.",
    "You call policy changes 'updates' and hope no one reads them."
  ],
  "tester": [
    "You find bugs like they're collectibles — then lose the evidence.",
    "You test boundaries by breaking everything within reach.",
    "You call it 'regression testing' because nothing ever progresses.",
    "You file bug reports that read like a thriller — confusing and dramatic.",
    "You test in production because staging is too much effort.",
    "You chase flaky tests like they're unicorns — mythical and unreliable.",
    "You prioritize edge cases like they're your hobby.",
    "You write test cases that require a PhD and a prayer.",
    "You report bugs with screenshots and a cry for help.",
    "You say 'it's working for me' and leave the rest to fate.",
    "You find one bug and create a dependency tree of regrets.",
    "You automate tests only to automate your future complaints.",
    "You call a failed build a 'team bonding opportunity'.",
    "You test by clicking randomly and calling it exploratory.",
    "You think 'smoke test' means lighting the app on fire gently.",
    "You open tickets like it's a to-do list you won't finish.",
    "You test for power users and forget humans exist.",
    "You log bugs with the enthusiasm of a Shakespearean monologue.",
    "You reproduce issues so many times they file for restraining orders.",
    "You test permissions by trying every combo until someone screams.",
    "You treat test data like a buffet — a little of everything, none of it clean.",
    "You find UI inconsistencies like a hobbyist detective.",
    "You believe every new feature is a ticking time bomb.",
    "You run tests overnight and hope the morning brings miracles.",
    "You think 'pass' is just a polite suggestion.",
    "You blame the requirements before reading them.",
    "You assume 'works on my machine' is a valid release strategy.",
    "You submit bug reports that could double as fan fiction.",
    "You test like you're preparing for the apocalypse — thorough and anxious.",
    "You break new features faster than they can be documented.",
    "You call flaky a feature and get applause from chaos.",
    "You test with production data and pray GDPR forgives you.",
    "You consider intermittent failures a personality trait of the app.",
    "You reproduce bugs backwards and still call it progress.",
    "You test mobile on a phone older than some team members.",
    "You think 'manual testing' is a cardio workout.",
    "You celebrate a green build like it's a national holiday.",
    "You file duplicate tickets as a team-bonding exercise.",
    "You test corner cases so hard the corners file complaints."
  ],
  "ceo": [
    "You run the company like a startup — with optimism and zero budget discipline.",
    "You have a vision so vague it needs a fog machine.",
    "Your strategy meetings are just inspirational quotes with charts.",
    "You treat employee feedback like it's an episode of Shark Tank — entertaining but ignored.",
    "You chase quarterly headlines like a reality TV producer.",
    "You think 'pivot' is an exercise class, not a business decision.",
    "You sign off on initiatives like you're collecting glossy business cards.",
    "You measure success by logos on the website, not customer satisfaction.",
    "You cut costs so lovingly that morale filed for damages.",
    "You boast about agility while changing direction mid-meeting.",
    "You outsource responsibility and keep the trophy.",
    "You appoint synergies as the official company mascot.",
    "You make big promises with small plans attached by tape.",
    "You hold town halls so scripted they could double as infomercials.",
    "You consult the PowerPoint oracle before making a decision.",
    "You reward heroics and call them 'operational expenses'.",
    "You treat risk like a trendy accessory, not something to manage.",
    "You hire a consultancy for answers to questions you didn't know you had.",
    "You rewrite the mission statement like it’s a bedtime story.",
    "You measure leadership by headcount and headshots.",
    "You believe culture is a logo people wear instead of an experience people live.",
    "You set KPIs that require a decoder ring and a séance.",
    "You take credit for the sunrise and blame the team for the clouds.",
    "You use 'disruption' as an umbrella term for bad planning.",
    "You host retreats where the only outcome is Instagram content.",
    "You make decisions from an ivory tower with a terrible Wi‑Fi signal.",
    "You think transparency is an internal memo nobody reads.",
    "You chase growth like a hobby and forget profit likes commitments.",
    "You treat layoffs like a reset button for inconvenience.",
    "You call it 'visionary leadership' when it's just hopeful wandering.",
    "You preach empowerment and micromanage the emoji usage in Slack.",
    "You replace long-term strategy with inspirational clip art.",
    "You promote optimism until the numbers file a complaint.",
    "You believe 'disrupt' is a resume enhancement, not a plan.",
    "You set deadlines with the confidence of someone with a calendar assistant.",
    "You think brand value is polished slides and a catchy tagline.",
    "You sign off on 'synergy initiatives' that synergize into chaos.",
    "You lead like a CEO in a stock photo — approachable, vague, and oddly static.",
    "You announce bold bets and then ask for receipts at the next meeting."
  ],
  "sales": [
    "You turn 'touch base' into a full-contact sport.",
    "You call every lead 'hot' and every customer 'definitely closing this quarter'.",
    "Your pipeline is a waterpark of inflated hopes and leaking deals.",
    "You can demo enthusiasm better than the product can demo features.",
    "You follow up so much your calendar thinks it's being stalked.",
    "Your favorite metric is 'possibility' — which isn't a metric at all.",
    "You close deals like you close tabs: with blind optimism and regret.",
    "You believe every objection is just an opportunity to talk louder.",
    "You say 'value proposition' like it's a magic spell that never works.",
    "You offer discounts like a buffet chef offering free samples — endlessly.",
    "You sell the vision and forget to mention the subscription fee.",
    "You treat pricing objections like a personal insult.",
    "You pitch urgency so often even the calendar gets nervous.",
    "You think 'no' is just 'not yet' — and 'not yet' is forever.",
    "You prospect like you're speed-dating the company phonebook.",
    "You call it 'consultative selling' and consult until the prospect falls asleep.",
    "You have more follow-ups than actual conversions.",
    "You can upsell a stapler to someone who doesn't own paper.",
    "You believe in nurture sequences and nothing else.",
    "You sell promises and outsource delivery to the product team.",
    "You craft emails that sound like fortune cookies written by a robot.",
    "You treat every lead as a potential trophy and every call as a victory lap.",
    "You close with 'is there anything else?' and reopen the deal like a sequel.",
    "You measure success in demos booked, not problems solved.",
    "You call objections 'challenges' and then ignore them.",
    "You can find a decision-maker's voicemail faster than their attention span.",
    "You spin features into outcomes like a carnival magician.",
    "You attend networking events like a migratory bird of LinkedIn connections.",
    "You use buzzwords as adhesive for weak arguments.",
    "You believe 'trial' means 'permanent trial and error.'",
    "You chase quotas like they're Pokemon and keep saying 'gotta catch 'em all.'",
    "You treat contracts like suggestions with an expiration date you ignore.",
    "You sell hope with a handshake and hand over the invoice later.",
    "You think 'closing' is yelling 'deal' louder than the competition.",
    "You turn discovery calls into monologues about your trophy desk.",
    "You can detect a gatekeeper and immediately invent a promotion.",
    "You call cold calls 'relationship building' with frozen charm.",
    "You pitch ROI so long the return files for divorce.",
    "You believe every 'maybe later' is secretly 'buy now' in disguise."
  ],
  "support": [
    "You answer tickets like you're speed-reading a mystery novel — mostly skipping the plot.",
    "You put customers on hold so long they finish making their own support department.",
    "You solve problems with canned responses and a smile that can't be seen.",
    "You treat triage like a game of 'let it simmer.'",
    "You think 'escalate' means forwarding the ticket and taking a coffee break.",
    "You know every disposition code except the one that actually helps the customer.",
    "You archive complaints like they're collectible postcards of disappointment.",
    "You close tickets with 'please reopen if needed' and an artful shrug.",
    "You say 'we're looking into it' and then look at your watch instead.",
    "You have a PhD in placeholder troubleshooting: 'works for me' studies.",
    "You can read a script verbatim but not read the room.",
    "You treat knowledge base articles like bedtime stories — read once, never reviewed.",
    "You promise callbacks with the confidence of a weather forecast.",
    "You triage with the enthusiasm of someone filing taxes.",
    "You fix problems by rebooting the customer's patience.",
    "You can escalate a ticket faster than you can escalate urgency.",
    "You consider 'resolved' a mood, not a status.",
    "You manage SLAs like suggestions, not obligations.",
    "You know seven ways to apologize and zero ways to solve it permanently.",
    "You answer a user's panic with a link to a PDF and call it empowerment.",
    "You handle angry customers like a diplomat for tiny disasters.",
    "You swap tickets like trading cards but never trade solutions.",
    "You have more macros than miracles.",
    "You answer 'Is this urgent?' with 'Depends who's asking.'",
    "You collect follow-ups like stamps and never mail them.",
    "You triage everything as 'low priority' until the escalation mountain forms.",
    "You think 'root cause' is a gardening term.",
    "You can type 'Can you confirm your browser?' faster than you can troubleshoot it.",
    "You treat multi-step fixes like epic sagas with cliffhangers.",
    "You replace human empathy with polite punctuation and an emoji.",
    "You close tickets by changing the status and not the outcome.",
    "You think 'callback' is a legendary beast spoken of in myths.",
    "You can reproduce an issue in the ticket system but not on the customer's screen.",
    "You file duplicate tickets to feel like progress was made.",
    "You escalate to engineering and consider that applause.",
    "You think 'weird' is an adequate technical diagnosis.",
    "You have a signature that reads like an official cease-and-desist for patience.",
    "You turn simple issues into multi-day mysteries.",
    "You treat onboarding as a scavenger hunt and celebrate every found checkbox.",
    "You end every call with 'have a great day' and leave the problem behind."
  ]
}
